# 신문기사 카테고리 중 국제 타이틀 10개를 가지고와서
# 하나의 string으로 만드세요.
# 그 중 '러시아'라는 단어가 몇 번 나오는지 카운트
# 단어의 개수는?
# 단어 중 러시아라는 단어의 위치는 몇번쨰인지 모두 프린트
# 신문기사의 내용 중 러시아를 소련으로 모두 대체 후 프린트
# 전쟁으로 시작하는 단어를 모두 하나의 리스트로 모아서 몇 개인지 세보고 프린트

news='''
러시아의 우크라이나 침공을 규탄하고 즉각 철군을 요구하는 내용의 결의안이 유엔총회에서 채택됐습니다.

유엔은 현지시간으로 2일 미국 뉴욕 유엔본부에서 긴급특별총회를 열어 러시아를 규탄하고 철군을 요구하는 내용의 결의안이 찬성 141표, 반대 5표, 기권 35표로 가결됐다고 밝혔습니다.

결의안에는 "러시아의 2월24일 `특별 군사작전` 선언을 규탄한다"며 "무력 사용 또는 위협으로 얻어낸 영토는 합법적으로 인정되지 않는다"는 내용이 담겼습니다.

결의안은 러시아의 우크라이나 침공과 핵무력 태세 강화 결정을 규탄하고, 러시아가 우크라이나 영토에서 즉각적이고 완전하며 무조건적으로 군병력을 철수할 것을 요구했습니다.

이밖에 우크라이나의 주권, 독립, 영토보전에 대한 약속 재확인 , 우크라이나를 상대로 한 러시아의 무력 사용 즉각 중단 요구 , 벨라루스의 불법 무력사용에 대한 개탄 등의 내용도 명시됐습니다.

긴급총회 결의안은 유엔 안전보장이사회 결의안과 달리 법적 구속력은 없지만 140개국 이상의 압도적인 찬성표가 나온 만큼 러시아에게 상당한 압박이 될 전망입니다.

중요 안건은 193개 회원국 중 표결 참가국 3분의 2 이상이 찬성해야 채택되며, 북한과 벨라루스, 에리트리아, 러시아, 시리아가 반대표를 던졌고, 친 러시아 성향으로 분류되는 중국은 기권했습니다.
'''
news+='''
러시아 재벌 로만 아브라모비치(55)가 잉글랜드 프리미어리그(EPL) 첼시 구단을 매각한다. 아브라모비치는 러시아의 우크라이나 침공으로 제재 압박을 받아왔다.
로이터통신 등에 따르면, 아브라모비치는 EPL 첼시 구단을 매각하기로 했다고 2일(현지시간) 밝혔다. 그는 “나는 항상 구단의 최대 이익을 고려해 결정을 내렸다”면서 “이에 따라 현재 상황에서는 구단을 매각하기로 했다”고 말했다. 아브라모비치는 2003년 첼시 구단을 인수했다.
아브라모비치는 우크라이나 전쟁 희생자들을 위한 자선 재단을 설립해 구단 매각을 통해 얻는 순수익을 모두 재단에 기부할 것이라고 밝혔다. 약 15억 파운드(약 2조4000억원)로 알려진 대여금도 구단으로부터 돌려받지 않겠다고 말했다.

'''
news+='''
러시아가 우크라이나로 진격한 지 일주일째인 2일(현지시간)에도 우크라이나 수도 키이우(키예프의 우크라이나식 발음)에 대한 러시아군의 공세가 이어졌다.

크림반도 인근의 도시 헤르손이 러시아군에 점령됐다는 내용이 보도됐으며, 항구도시 마리우폴에서도 교전이 이뤄진 것으로 알려졌다.

이날 러시아 국방부는 우크라이나 내 군사작전으로 자국 군인이 500명 가까이 사망했다고 첫 공식 발표했다. AP와 로이터 등 외신에 따르면 러시아 공군은 이날 하르키우 도심에 대대적인 폭격을 가했다.

올레그 시네후보프 하르키우 행정국장은 "지난 24시간 동안 최소 21명이 숨지고, 112명이 사망했다"고 말했다.

하르키우 경찰청 건물과 정보국, 대학 등이 이날 폭격으로 모두 파괴됐다. 현지 재난당국에 따르면 민간인 거주 지역의 여러 건물도 공습으로 피해를 봤다. 다만 우크라이나군도 항전을 이어가 하르키우 상공에서 러시아 군용기 여러 대를 격추한 것으로 알려졌다.

우크라이나 군 당국과 AFP 통신에 따르면 러시아 공수부대는 이날 하르키우 도심에 진입해 현지 병원을 공격했다.

올렉시 아레스토비치 우크라이나 대통령실장 고문은 하르키우를 제2차 세계대전 당시 독일군과의 치열한 전투가 벌어진 스탈린그라드에 빗대면서 결사 항전을 천명했다.

수도 키이우 역시 연일 공격받고 있다. 로이터 통신은 우크라이나 내무부를 인용해 이날 오후 키이우 도심 기차역 인근에서 강력한 폭발이 일어났다고 보도했다.

다만 기차역 인근 폭발은 러시아군의 직접 타격이 아니라 격추된 러시아 순항미사일 잔해 때문에 발생했다고 내무부 고문은 설명했다.
미 국방부에 따르면 러시아군은 키이우 시내 사회기반시설을 목표로 잡고 공세를 이어가고 있으며 미사일과 대포 공격이 증가하는 양상이다. 다만 우크라이나군이 저지에 나서면서 러시아군은 키이우 외곽에 발이 묶인 상태다.

현재 러시아군은 키이우를 압박하고자 대규모 기갑부대를 투입한 상황이다. 러시아 매체 '노바야 가제타'에 따르면 우크라이나군 제95공수여단이 주둔 중인 도시 지토미르에서도 포격으로 민간인 4명이 사망했다.

또 이고리 콜리카예프 헤르손 시장은 러시아군이 밤새 기차역과 항구, 몇몇 관공서를 장악했다고 현지 언론에 설명한 것으로 전해졌다. 현지 매체는 남부 항구도시 마리우폴에서도 러시아군의 공격으로 100명 이상이 다쳤다고 보도했다.

사상자는 러시아군 측에서도 발생했다. 이고리 코나셴코프 러시아 국방부 대변인은 이날 언론 브리핑에서 "우크라이나 군사작전에 참여 중인 러시아 군인 498명이 임무 수행 중 숨졌고, 1597명이 부상했다"고 밝혔다.

코나셴코프 대변인은 "우크라이나 군인 사망자는 2870명이고, 부상자는 약 3700명"이라고 설명했다. 우크라이나 침공 이후 러시아가 자국 병력 손실에 대해 구체적으로 밝힌 건 이번이 처음이다.

러시아와 우크라이나는 일주일째 교전을 이어가고 있다. 3일 오전 폴란드와 인접한 벨라루스 서남부 브레스트주(州)의 '벨라베슈 숲'에서 만나 2차 평화협상을 벌일 예정이다.
'''
news+='''

러시아 대표단장인 블라디미르 메딘스키 대통령 보좌관이 2일 2차 협상장인 벨라루스 '벨라베슈 숲'에서 기자들과 만나 발언하고 있다. 브레스트=AP 연합뉴스

당초 2일(현지시간) 열릴 예정이었던 우크라이나와 러시아 간 2차 회담이 3일로 연기됐다. 우크라이나 대표단의 회담장 도착이 지연되면서 빚어진 일이다. 베일에 가려져 있던 회담 장소도 공개됐다. 1991년 12월 소련 해체 및 독립국가연합(CIS) 창설 협정이 맺어졌던 역사적 장소에서 회담이 열린다.


김진욱 기자 kimjinuk@hankookilbo.com
'''
news+='''
국제형사재판소(ICC)가 2013년 이후 우크라이나에서 벌어지고 있는 상황과 관련해 전쟁범죄 조사에 착수했다고 AP통신과 로이터통신 등이 2일(현지시간) 보도했다.
카림 칸 ICC 검찰 검사장은 39개 회원국들의 요청을 받고 우크라이나 내 전쟁범죄 증거 수집을 시작했다고 밝혔다. 그는 성명을 통해 “(ICC 회부에 따라) 2013년 11월21일 이후의 우크라이나 상황에 대한 조사를 시작할 수 있게 됐다”면서 “따라서 우크라이나 영토에서 저질러진 전쟁범죄, 인도에 반하는 죄, 집단학살에 대한 현재와 과거의 모든 주장에 대한 조사를 망라한다”고 말했다.
앞서 칸 검사장은 지난달 28일 “우크라이나에서 전쟁 범죄와 반인류 범죄가 자행됐다고 믿을 만한 합리적인 근거가 있다”며 “최대한 신속하게 우크라이나 내 전쟁범죄와 반인도 범죄에 대한 조사를 시작할 계획”이라고 밝힌 바 있다.
ICC는 2014년 우크라이나 동부 돈바스 지역에서 정부군과 친러 반군이 충돌한 돈바스 전쟁과 러시아가 우크라이나의 크림반도를 강제병합했을 당시 전쟁범죄에 대해 사전 조사를 해왔다.
'''
news+='''
한국의 연주단체에서 활동하던 우크라이나인 연주자가 러시아의 침공에 맞선 전쟁에 참전하기 위해 귀국했다.
하성호 서울팝스오케스트라 지휘자는 3일 통화에서 “우크라이나 출신 단원들의 행방이 묘연해 수소문한 결과, 그 중 한 명이 조국에서 군복을 입고 찍은 사진을 보내왔다”고 말했다.
서울팝스오케스트라는 1988년 창단됐으며, 총 72명 단원 중 20여명이 외국인이다. 이 중 우크라이나인은 4명이다. 러시아가 우크라이나를 침공한 후, 하 지휘자가 이들의 안부가 궁금해 연락하니 한국인 아내와 아이가 있어서 한국에 있는 것으로 확인된 한 명을 제외하고는 연락이 닿지 않았다고 한다.
오케스트라 측이 사회관계망서비스(SNS)를 통해 수소문한 결과, 콘트라베이스 연주자 지우즈킨 드미트로(47)가 군복을 입은 사진을 오케스트라로 보내왔다. 드미트로는 2002년 입단했다. 그는 연락이 닿지 않는 또다른 우크라이나 단원인 비올라 연주자 레우 켈레르(51), 트럼펫 연주자 마트비옌코 코스탄틴(52)과 키이우(키예프) 국립음악원 선후배 사이다. 켈레르와 코스탄틴도 우크라이나로 돌아갔을 가능성이 있다.
서울팝스오케스트라는 코로나19 확산으로 연주가 줄어 지난 1월 연주회가 마지막 모임이었다. 하 지휘자는 “연주가 줄어 그동안 생계가 어려웠을 것이다. 드미트로가 떠나기 전 재직증명서를 떼어갔다고 하는데, 비행기표를 구하기 위해 대출을 받은 것 같다”고 말했다. 그는 “평생 음악만 해온 50대 전후 단원들이 나라를 지키기 위해 총을 들었다는 소식에 가슴이 아팠다. 무사히 돌아오기만을 바랄 뿐”이라고 말했다.
'''
news+='''
[앵커]

러시아가 우크라이나를 침공한 지 일주일이 지난 가운데, 러시아 외무장관이 "제3차 세계대전이 일어난다면 파멸적인 핵전쟁이 될 것"이라고 경고했습니다. 러시아 국방부는 이번 작전에서 숨진 자국 군인이 500명 정도라고 밝혔는데요, 우크라이나는 축소된 숫자라고 주장했습니다.

이 소식은 안의근 기자가 보도합니다. 

[기자]

러시아 외무장관의 핵전쟁 발언은 알자리라 방송과의 인터뷰에서 나왔습니다.

앞서 조 바이든 미국 대통령은 러시아의 우크라이나 침공에 맞선 선택지로 "러시아를 공격해 제3차 세계대전을 시작하거나 국제법을 위반한 나라가 대가를 치르게 하는 방법이 있다"고 말했습니다.

라브로프 러시아 외무장관은 바이든 대통령의 이 발언을 인용하면서 "제3차 세계대전이 일어난다면 그것은 파멸적인 핵전쟁이 될 것"이라고 한 겁니다.

라브로프 장관은 최근 우크라이나 침공 논리로 우크라이나의 핵위협을 주장하기도 했습니다.

[세르게이 라브로프/러시아 외무장관 (지난 1일 유엔군축회의) : 우크라이나는 소련의 기술과 무기 발사 수단을 여전히 가지고 있습니다. 우리는 이런 실제 위험에 대응할 수밖에 없습니다.]

러시아 외무차관도 경고성 메시지를 내놨습니다.

알렉산드르 그루슈코 러시아 외무차관은 "북대서양조약기구, NATO의 우크라이나에 대한 무기 공급을 우려하고 있다"면서 "러시아와 NATO 간에 무력충돌이 일어나지 않으리란 어떠한 보장도 없다"고 했습니다.

러시아는 또 처음으로 전사한 군인 숫자를 밝혔습니다.

[이고리 코나셴코프/러시아 국방부 대변인 : 불행하게도 특별작전에 참가 중인 우리 군대에도 손실이 있습니다. 498명이 임무 중 숨졌습니다. 사망 군인의 가족에게는 모든 가능한 지원 조치를 하고 있습니다.]

다만 우크라이나 대통령실은 지금까지 러시아 군인 7천 명 이상이 숨졌다고 주장했습니다.

이런 가운데 우크라이나와 러시아 간 2차 회담은 폴란드와 접경한 벨라루스에서 현지시간 2일 열릴 예정이었지만 우크라이나 대표단의 도착이 늦어지면서 하루 연기됐습니다. 
'''
news+='''
【 앵커멘트 】
우크라이나 사태와 관련해 열린 유엔 긴급특별총회에서 140표가 넘는 찬성으로 러시아의 철군을 요구하는 결의안이 통과됐습니다.
미국은 우크라이나를 침공 중인 러시아를 상대로 각종 추가 제재 방침을 밝혔습니다.
보도에 김태림 기자입니다.


【 기자 】
"투표 결과는, 총 찬성 141표, 반대 5표, 기권 35표입니다."

러시아의 우크라이나 침공을 규탄하고 철군을 요구하는 내용의 결의안이 유엔총회에서 채택됐습니다.

유엔은 현지시간 2일 우크라이나 사태에 관한 긴급특별총회에서 140개국 이상이 찬성해 결의안이 통과됐다고 밝혔습니다.

이번 결의안과 같은 중요 안건은 193개 회원국 중 표결 참가국 3분의 2 이상이 찬성해야만 채택됩니다.

유엔 안전보장이사회 결의안과 달리 법적 구속력은 없지만, 압도적인 찬성표가 나온 만큼 러시아가 상당한 압박을 느낄 것으로 예상됩니다.

▶ 인터뷰 : 린다 토마스-그린필드 / 주유엔 미국대사
- "우리는 러시아에 이유 없는, 비양심적인 전쟁을 중단할 것을 촉구합니다. 또 러시아가 우크라이나의 주권과 영토 보전을 존중할 것을 요구합니다."

미국은 러시아에 대한 추가 제재안도 발표했습니다.

백악관은 러시아군 지원을 위한 핵심 수입원인 러시아 정유사를 대상으로 수출통제를 한
다고 밝혔습니다.

원유 및 가스 추출 장비에 대한 수출 통제를 통해 러시아의 장기적인 정유 능력 지원에 필요한 기술 수출에 제약을 가하기로 한 겁니다.

또 전투기, 보병 전투 차량 등을 제작하는 러시아 방위와 관계있는 22개 단체를 제재 대상으로 지정한다고 말했습니다.

한편, 각종 제재가 계속되는 가운데, 세계은행과 국제통화기금, IMF는 이번 주 긴급자금 3억 5천만 달러 지원안 처리를 포함해, 수개월 안에 우크라이나에 30억 달러, 한화 3조 6천억 원의 자금을 지원할 계획이라고 밝혔습니다.

MBN뉴스 김태림입니다. [goblyn.mik@mbn.co.kr]

영상편집 : 김상진
'''
news+='''
(뉴욕=연합뉴스) 강건택 특파원 = 우크라이나 전쟁이 장기화하는 가운데 주요 산유국들이 소폭 증산을 결정한 여파로 국제유가가 또 급등했다.

2일(현지시간) 뉴욕상업거래소(NYMEX)에서 4월 인도분 서부 텍사스산 원유(WTI)는 전날보다 배럴당 7%(7.19달러) 급등한 110.60달러에 거래를 마쳤다.

금융정보업체 팩트셋에 따르면 이날 WTI 종가는 지난 2011년 5월 이후 거의 11년 만에 최고가 마감이다.


런던 ICE선물거래소의 5월물 브렌트유도 오후 7시43분(런던 현지시간) 현재 배럴당 7.9%(8.29달러) 치솟은 113.26달러에 거래되고 있다. 2014년 6월 이후 최고 수준이다.


전쟁 격화로 원유 공급망에 계속 차질이 빚어질 것이라는 전망이 이틀 연속 큰 폭으로 유가를 끌어올린 것으로 분석된다.

이날 러시아는 우크라이나 제2 도시인 하리코프에 공수부대를 투입해 공격을 퍼붓고, 수도 키이우(키예프)를 향해 대규모 병력을 이동시키는 등 공세의 고삐를 죄고 있다.

이런 가운데 조 바이든 미국 대통령이 러시아를 상대로 원유와 가스 수출 제재 가능성을 내비쳐 글로벌 원유 공급난 우려를 키웠다. 러시아는 세계 3위 산유국이다.

그러나 석유수출국기구(OPEC)와 러시아 등의 협의체인 'OPEC 플러스'(OPEC+)는 공급부족 가능성에도 불구하고 4월 산유량을 3월보다 불과 40만 배럴(하루)만 늘리기로 결정했다.

미국을 포함한 국제에너지기구(IEA) 회원국들은 전날 유가 안정을 위해 비상 비축유 6천만 배럴을 방출하기로 합의했으나, 시장에 미친 효과는 적었다.

다만 러시아와 우크라이나의 2차 회담 기대가 커지면서 안전자산인 금은 3거래일 만에 처음으로 하락했다.

뉴욕상품거래소에서 4월 인도분 금은 온스당 1.1%(21.50달러) 떨어진 1,922.30달러에 장을 마감했다.
'''

news2=news.split()


print('러시아가 나온 개수는 {0}개 입니다'.format(news2.count('러시아')))
print('단어의 개수는 총 {0}개 입니다.'.format(len(news2)))

ru_list=[]
for i in range(0, len(news2), 1):
    if(news2[i]=='러시아'):
        ru_list.append(i)
print('러시아가 나온 단어들의 위치는 {0}'.format(ru_list))

print(news.replace('러시아', '소련'))

war_list=[]
for i in range(0, len(news2), 1):
    if(news2[i].startswith('전쟁')):
        war_list.append(news2[i])
print('전쟁으로 시작하는 단어의 개수는 {0}개 입니다'.format(len(war_list)))
print(war_list)